Repository: joaogiacometti/GigAuth
Catalog: src/GigAuth.Exception/Resources/ResourceErrorMessages.*.resx
Languages: pt

# EMAIL_EMPTY
source: Email is required.
pt: O e-mail é obrigatório.

# EMAIL_INVALID
source: The provided email is invalid or already in use.
pt: E-mail inválido ou já utilizado.

# EMAIL_TOO_LONG
source: Email cannot exceed 256 characters.
pt: O e-mail não pode exceder 256 caracteres.

# INVALID_PASSWORD
source: Your password must be at least 8 characters long and include at least one uppercase letter, one lowercase letter, one number and a special caractere.
pt: Sua senha deve ter pelo menos 8 caracteres e incluir pelo menos uma letra maiúscula, uma letra minúscula, um número e um caractere especial.

# UNKNOWN_ERROR
source: An unknown error has occurred.
pt: Ocorreu um erro desconhecido.

# USER_NAME_ALREADY_USED
source: The username is already used.
pt: O nome de usuário já está em uso.

# USER_NAME_EMPTY
source: Username is required.
pt: O nome de usuário é obrigatório.

# USER_NAME_TOO_LONG
source: Username cannot exceed 100 characters.
pt: O nome de usuário não pode exceder 100 caracteres.

# USER_NAME_TOO_SHORT
source: Username must be at least 8 characters.
pt: O nome de usuário deve ter pelo menos 8 caracteres.

# INVALID_CREDENTIALS
source: Invalid credentials. Email or password is incorrect.
pt: Credenciais inválidas. O e-mail ou a senha estão incorretos.
